# Dotfiles management
tap 'thoughtbot/formulae'
brew 'rcm'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'
# Install Bash 4
brew 'bash'

# Used for tmux+vim copying
brew 'reattach-to-user-namespace'

# Install wget with IRI support
brew 'wget --enable-iri'

# Install more recent versions of some OS X tools
tap 'homebrew/dupes'
brew 'homebrew/dupes/grep'
tap 'josegonzalez/homebrew-php'
brew 'php55'

# Install other useful binaries
brew 'git'
brew 'mercurial'
brew 'rbenv'
brew 'ruby-build'
brew 'ack'
brew 'node'
brew 'pigz'
brew 'rename'
brew 'mutt'
brew 'newsbeuter'
brew 'zsh-completions'
brew 'vim'

brew 'z'

tap 'homebrew/versions'
brew 'lua52'

# Install native apps
tap 'phinze/homebrew-cask'
brew 'brew-cask'

cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'iterm2'
cask 'rdio'
cask 'sublime-text'
cask 'vlc'
