brew 'exa'
brew 'neovim'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'tmux'
brew 'tree-sitter'
brew 'starship'
brew 'wget'
brew 'zsh-vi-mode'

cask '1password'
cask 'alfred'
cask 'amethyst'
cask 'bartender'
cask 'discord'
cask 'karabiner-elements'
cask 'spotify'
cask 'textual'
cask 'wezterm'
cask 'zoom'
